<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------

    // 应用调试模式
    'app_debug'              => true,
    // 应用Trace
    'app_trace'              => false,
    // 应用模式状态
    'app_status'             => '',
    // 是否支持多模块
    'app_multi_module'       => true,
    // 入口自动绑定模块
    'auto_bind_module'       => false,
    // 注册的根命名空间
    'root_namespace'         => [],
    // 扩展函数文件
    'extra_file_list'        => [THINK_PATH . 'helper' . EXT],
    // 默认输出类型
    'default_return_type'    => 'html',
    // 默认AJAX 数据返回格式,可选json xml ...
    'default_ajax_return'    => 'json',
    // 默认JSONP格式返回的处理方法
    'default_jsonp_handler'  => 'jsonpReturn',
    // 默认JSONP处理方法
    'var_jsonp_handler'      => 'callback',
    // 默认时区
    'default_timezone'       => 'PRC',
    // 是否开启多语言
    'lang_switch_on'         => false,
    // 默认全局过滤方法 用逗号分隔多个
    'default_filter'         => '',
    // 默认语言
    'default_lang'           => 'zh-cn',
    // 应用类库后缀
    'class_suffix'           => false,
    // 控制器类后缀
    'controller_suffix'      => false,

    // +----------------------------------------------------------------------
    // | 模块设置
    // +----------------------------------------------------------------------

    // 默认模块名
    'default_module'         => 'index',
    // 禁止访问模块
    'deny_module_list'       => ['common'],
    // 默认控制器名
    'default_controller'     => 'Index',
    // 默认操作名
    'default_action'         => 'index',
    // 默认验证器
    'default_validate'       => '',
    // 默认的空控制器名
    'empty_controller'       => 'Error',
    // 操作方法后缀
    'action_suffix'          => '',
    // 自动搜索控制器
    'controller_auto_search' => false,

    // +----------------------------------------------------------------------
    // | URL设置
    // +----------------------------------------------------------------------

    // PATHINFO变量名 用于兼容模式
    'var_pathinfo'           => 's',
    // 兼容PATH_INFO获取
    'pathinfo_fetch'         => ['ORIG_PATH_INFO', 'REDIRECT_PATH_INFO', 'REDIRECT_URL'],
    // pathinfo分隔符
    'pathinfo_depr'          => '/',
    // URL伪静态后缀
    'url_html_suffix'        => 'html',
    // URL普通方式参数 用于自动生成
    'url_common_param'       => false,
    // URL参数方式 0 按名称成对解析 1 按顺序解析
    'url_param_type'         => 0,
    // 是否开启路由
    'url_route_on'           => true,
    // 路由使用完整匹配
    'route_complete_match'   => false,
    // 路由配置文件（支持配置多个）
    'route_config_file'      => ['route'],
    // 是否开启路由解析缓存
    'route_check_cache'      => false,
    // 是否强制使用路由
    'url_route_must'         => false,
    // 域名部署
    'url_domain_deploy'      => false,
    // 域名根，如thinkphp.cn
    'url_domain_root'        => '',
    // 是否自动转换URL中的控制器和操作名
    'url_convert'            => true,
    // 默认的访问控制器层
    'url_controller_layer'   => 'controller',
    // 表单请求类型伪装变量
    'var_method'             => '_method',
    // 表单ajax伪装变量
    'var_ajax'               => '_ajax',
    // 表单pjax伪装变量
    'var_pjax'               => '_pjax',
    // 是否开启请求缓存 true自动缓存 支持设置请求缓存规则
    'request_cache'          => false,
    // 请求缓存有效期
    'request_cache_expire'   => null,
    // 全局请求缓存排除规则
    'request_cache_except'   => [],

    // +----------------------------------------------------------------------
    // | 模板设置
    // +----------------------------------------------------------------------

    'template'               => [
        // 模板引擎类型 支持 php think 支持扩展
        'type'         => 'Think',
        // 默认模板渲染规则 1 解析为小写+下划线 2 全部转换小写
        'auto_rule'    => 1,
        // 模板路径
        'view_path'    => '',
        // 模板后缀
        'view_suffix'  => 'html',
        // 模板文件名分隔符
        'view_depr'    => DS,
        // 模板引擎普通标签开始标记
        'tpl_begin'    => '{',
        // 模板引擎普通标签结束标记
        'tpl_end'      => '}',
        // 标签库标签开始标记
        'taglib_begin' => '{',
        // 标签库标签结束标记
        'taglib_end'   => '}',
    ],

    // 视图输出字符串内容替换
    'view_replace_str'       => [],
    // 默认跳转页面对应的模板文件
    'dispatch_success_tmpl'  => THINK_PATH . 'tpl' . DS . 'dispatch_jump.tpl',
    'dispatch_error_tmpl'    => THINK_PATH . 'tpl' . DS . 'dispatch_jump.tpl',

    // +----------------------------------------------------------------------
    // | 异常及错误设置
    // +----------------------------------------------------------------------

    // 异常页面的模板文件
    'exception_tmpl'         => THINK_PATH . 'tpl' . DS . 'think_exception.tpl',

    // 错误显示信息,非调试模式有效
    'error_message'          => '页面错误！请稍后再试～',
    // 显示错误信息
    'show_error_msg'         => false,
    // 异常处理handle类 留空使用 \think\exception\Handle
    'exception_handle'       => '',

    // +----------------------------------------------------------------------
    // | 日志设置
    // +----------------------------------------------------------------------

    'log'                    => [
        // 日志记录方式，内置 file socket 支持扩展
        'type'  => 'File',
        // 日志保存目录
        'path'  => LOG_PATH,
        // 日志记录级别
        'level' => [],
    ],

    // +----------------------------------------------------------------------
    // | Trace设置 开启 app_trace 后 有效
    // +----------------------------------------------------------------------
    'trace'                  => [
        // 内置Html Console 支持扩展
        'type' => 'Html',
    ],

    // +----------------------------------------------------------------------
    // | 缓存设置
    // +----------------------------------------------------------------------

    'cache'                  => [
        // 驱动方式
        'type'   => 'File',
        // 缓存保存目录
        'path'   => CACHE_PATH,
        // 缓存前缀
        'prefix' => '',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
    ],

    // +----------------------------------------------------------------------
    // | 会话设置
    // +----------------------------------------------------------------------

    'session'                => [
        'id'             => '',
        // SESSION_ID的提交变量,解决flash上传跨域
        'var_session_id' => '',
        // SESSION 前缀
        'prefix'         => 'think',
        // 驱动方式 支持redis memcache memcached
        'type'           => '',
        // 是否自动开启 SESSION
        'auto_start'     => true,
    ],

    // +----------------------------------------------------------------------
    // | Cookie设置
    // +----------------------------------------------------------------------
    'cookie'                 => [
        // cookie 名称前缀
        'prefix'    => '',
        // cookie 保存时间
        'expire'    => 0,
        // cookie 保存路径
        'path'      => '/',
        // cookie 有效域名
        'domain'    => '',
        //  cookie 启用安全传输
        'secure'    => false,
        // httponly设置
        'httponly'  => '',
        // 是否使用 setcookie
        'setcookie' => true,
    ],

    //分页配置
    'paginate'               => [
        'type'      => 'bootstrap',
        'var_page'  => 'page',
        'list_rows' => 15,
    ],
    //密码盐值
    'QS_pwdhash' => 'rhm=SRuK0gc9-X!q',

    //重庆就业网单位类型码值
    'comtype'               => [
        '国企'      => '110',
        '民营'  => '10',
        '合资'  => '10',
        '外商独资'      => '10',
        '股份制企业'  => '10',
        '上市公司'  => '10',
        '国家机关'      => '30',
        '事业单位'  => '50',
        '其它'  => '900',
    ],

    //重庆就业网企业规模字典
    'comscale'               => [
        '20人以下'      => '6',
        '20-99人'  => '5',
        '100-499人'  => '4',
        '500-999人'      => '3',
        '1000-9999人'  => '2',
        '10000人以上'  => '1',
    ],

    //重庆就业网企业行业字典
    'combusiness'               => [
        '计算机软件/硬件'      => '0700',
        '计算机系统/维修'  => '0761',
        '通信(设备/运营/服务)'  => '0340',
        '互联网/电子商务'      => '0761',
        '网络游戏'  => '1800',
        '电子/半导体/集成电路'  => '0340',
        '仪器仪表/工业自动化'      => '0341',
        '会计/审计'  => '1000',
        '金融(投资/证券'  => '1000',
        '金融(银行/保险)'      => '1000',
        '贸易/进出口'  => '1274',
        '批发/零售'  => '0800',
        '消费品(食/饮/烟酒)'      => '0800',
        '服装/纺织/皮革'  => '0318',
        '家具/家电/工艺品/玩具'  => '0321',
        '办公用品及设备'      => '0341',
        '机械/设备/重工'  => '0339',
        '汽车/摩托车/零配件'  => '0337',
        '制药/生物工程'      => '0327',
        '医疗/美容/保健/卫生'  => '1785',
        '医疗设备/器械'  => '0327',
        '广告/市场推广'      => '1274',
        '会展/博览'  => '1583',
        '影视/媒体/艺术/出版'  => '1890',
        '印刷/包装/造纸'      => '0322',
        '房地产开发'  => '1100',
        '建筑与工程'  => '0500',
        '家居/室内设计/装潢'      => '0547',
        '物业管理/商业中心'  => '1900',
        '中介服务/家政服务'  => '1583',
        '专业服务/财会/法律'      => '1376',
        '检测/认证'  => '1376',
        '教育/培训'  => '1600',
        '学术/科研'      => '1375',
        '餐饮/娱乐/休闲'  => '0900',
        '酒店/旅游'  => '0966',
        '交通/运输/物流'      => '0600',
        '航天/航空'  => '1994',
        '能源(石油/化工/矿产)'  => '0207',
        '能源(采掘/冶炼/原材料)'      => '0332',
        '电力/水利/新能源'  => '0400',
        '政府部门/事业单位'  => '1994',
        '非盈利机构/行业协会'      => '1996',
        '农业/渔业/林业/牧业'  => '0100',
        '其他行业'  => '1583',
    ],

    //重庆就业网文化程度字典
    'education'               => [
        '初中'      => '71',
        '高中'  => '61',
        '中技'  => '41',
        '中专'      => '41',
        '大专'  => '31',
        '本科'  => '21',
        '硕士'      => '14',
        '博士'  => '11',
        '博后'  => '11',
    ],

    //重庆就业网工作性质字典
    'jobtype'               => [
        '全职'  => '1',
        '兼职'  => '2',
        '实习'  => '3',
    ],

    //工作经验要求
    'workperiod'               => [
        '无经验'      => '00',
        '1年以下'  => '01',
        '1-3年'  => '01',
        '3-5年'      => '03',
        '5-10年'  => '05',
        '10年以上'  => '10',
    ],

    














    



















];
